/**
 * Created by showzyl on 16/7/26.
 */

'use strict'


let reg;

// 两位小数或者整数
reg = /^\d+\.?\d{0,2}$/;
//console.log(reg.test('123312321.223'));

// 只能输入数字
reg = /\D+/g;
'1x21x'.replace(reg, '');

// 只能是零和非零开头的数字  *
reg = /^(0|[1-9]\d)$/;

// 只能输入有两位小数的正实数
reg = /^\d+\.\d{2}$/;

// 只能输入有1~3位小数的正实数
reg = /^\d+\.\d{1,3}$/;

// 只能输入非零的正整数
reg = /^(\+)?\d+$/;

// 只能输入非零的负整数
reg = /^\-\d+$/;

// 只能输入长度为3的字符
reg = /^\w{3}$/;

// 只能输入由26个英文字母组成的字符串
reg = /^([a-zA-z])+$/;

// 以字母开头，长度在6~18之间，只能包含字符、数字和下划线
reg = /^[a-zA-Z]\w{5,17}$/;

// 只能输入汉字
reg = /^([\u4e00-\u9fa5])+$/;

// 验证Email地址
reg = /^\w+\@([a-zA-z\d]){2,10}\.([a-zA-z\d]){2,5}$/;

// 验证电话号码(座机)
reg = /^(0\d{2,3}\-)?\d{7,8}$/;

// 验证电话号码(手机)
reg = /^1\d{10}$/;

// url地址(仅能匹配http和https协议的)
reg = /^http(s)?\:\/\/(\w+\.){2}(\w+)?\/?((\/\w+)+)?(\?\w+=\w+)?((&\w+=\w+)+)?$/;

// 首尾空格
reg = /^\s+|\s+$/ig;

// 标签转译
reg = /<\/?[^>]*>/ig;

// 中文
reg = /[\u4E00-\u9FA5]/ig;

// base64 image/audio file
reg = /data\:(image|audio)\/(jpeg|png|jpg|m4a|mp3)\;base64\,((\/)?[A-Za-z0-9+/]+)+/ig

/**
 *  
 *  http://www.42du.cn/p/32
 */

/**
 * todo
 * 'aaabbccddd'  'a3b2c2d3'
 *
 */



























