/**
 * Created by showzyl on 16/7/26.
 */

'use strict'


let reg;

// 两位小数或者整数
reg = /^\d+\.?\d{0,2}$/;
//console.log(reg.test('123312321.223'));

// 只能输入数字
reg = /\D+/g;
'1x21x'.replace(reg, '');

// 只能是零和非零开头的数字  *
reg = /^(0|[1-9]\d)$/;

// 只能输入有两位小数的正实数
reg = /^\d+\.\d{2}$/;

// 只能输入有1~3位小数的正实数
reg = /^\d+\.\d{1,3}$/;

// 只能输入非零的正整数
reg = /^(\+)?\d+$/;

// 只能输入非零的负整数
reg = /^\-\d+$/;

// 只能输入长度为3的字符
reg = /^\w{3}$/;

// 只能输入由26个英文字母组成的字符串
reg = /^([a-zA-z])+$/;

// 以字母开头，长度在6~18之间，只能包含字符、数字和下划线
reg = /^[a-zA-Z]\w{5,17}$/;

// 只能输入汉字
reg = /^([\u4e00-\u9fa5])+$/;

// 验证Email地址
reg = /^\w+\@([a-zA-z\d]){2,10}\.([a-zA-z\d]){2,5}$/;

// 验证电话号码(座机)
reg = /^(0\d{2,3}\-)?\d{7,8}$/;

// 验证电话号码(手机)



// url地址
































